app/controllers/bookings_controller.rb

  def create
    @booking = current_user.bookings.build(booking_params)
    @booking.car_id = @car.id

      if @booking.save
---
INSERT INTO "bookings" ("customer_name", "comment", "car_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_name", "qwe"], ["comment", ""], ["car_id", 10], ["created_at", "2016-06-19 19:25:34.578772"], ["updated_at", "2016-06-19 19:25:34.578772"]]

  def update
      @booking.car_id = @car.id
      if @booking.update(booking_params)
---
UPDATE "bookings" SET "booked_from" = ?, "booked_to" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["booked_from", "2015-08-02"], ["booked_to", "2016-10-04"], ["updated_at", "2016-06-19 22:02:08.886015"], ["id", 4]]

  def destroy
    @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 6]]

    def set_car
      @car = Car.find(params[:car_id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", 10]]