app/controllers/cars_controller.rb

SELECT "categories".* FROM "categories"
SELECT "cars".* FROM "cars"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "B"]]
SELECT "cars".* FROM "cars" WHERE "cars"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 2]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."car_id" = ?  [["car_id", 10]]
---
	def index
		if params[:category].blank?
			@cars = Car.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@cars = Car.where(category_id: @category_id).order("created_at DESC")
		end
		@bookings = Booking.all

SELECT "bookings".* FROM "bookings" WHERE "bookings"."car_id" = ?  ORDER BY created_at DESC  [["car_id", 7]]
---
	def show
		@bookings = Booking.where(car_id: @car.id).order("created_at DESC")

INSERT INTO "cars" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Car #2"], ["description", "info"], ["user_id", 2], ["created_at", "2016-06-24 10:31:01.477672"], ["updated_at", "2016-06-24 10:31:01.477672"]]
---
	def create
		@car = current_user.cars.build(car_params)

		if @car.save

UPDATE "cars" SET "description" = $1, "updated_at" = $2 WHERE "cars"."id" = $3  [["description", "esahouh"], ["updated_at", "2016-06-24 09:28:15.961695"], ["id", 6]]
---
	def update
		if @car.update(car_params)

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."car_id" = $1 AND "bookings"."car_id" = $2  ORDER BY "bookings"."id" ASC LIMIT 1  [["car_id", 11], ["car_id", 11]]
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 11]]
---
	def destroy
		@car.destroy
		@bookings = @car.bookings.where(car_id: @car.id)
		@bookings.destroy_all

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", 6]]
---
	def find_car
		@car = Car.find(params[:id])