app/views/cars/_form.html.haml

	.form-group
		= f.collection_select :category_id, Category.all, :id, :name, {prompt: "Choose a category"}
---
SELECT "categories".* FROM "categories"